# 打印出所有的“水仙花数”，所谓“水仙化数”是指一个三位数，其各位数字立方和等于该数本身。
# 例如：153是一个“水仙花数”，因为153=1的三次方+5的三次方+3的三次方

# 方法一：
for i in range(100, 1000):
    a = i // 100
    b = (i - a * 100) // 10
    c = (i - a * 100) - b * 10
    if i == a ** 3 + b ** 3 + c ** 3:
        print(i)


# 方法二：
for a in range(100, 1000):
    x = int(str(a)[0])
    y = int(str(a)[1])
    z = int(str(a)[2])
    if a == (x ** 3 + y ** 3 + z ** 3):
        print("水仙花数是", a)


# 方法三：
for m in range(100, 1000):
    i = m // 100
    j = m // 10 % 10
    k = m % 10
    if m == i ** 3 + j ** 3 + k ** 3:
        print("水仙花数为", m)
