# 企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，
# 可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，
# 超过100万元的部分按1%提成，从键盘输入当月利润i，求应发放奖金总数？

# 方法一：
i = float(input('请输入当月利润(单位：万元)：'))
if i <= 10:
    s = i * 0.1
elif 10 < i <= 20:
    s = 10 * 0.1 + (i - 10) * 0.075
elif 20 < i <= 40:
    s = 10 * 0.1 + 10 * 0.075 + (i - 20) * 0.05
elif 40 < i <= 60:
    s = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (i - 40) * 0.03
elif 60 < i <= 100:
    s = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015
elif 100 < i:
    s = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (i - 100) * 0.01
print('当月发放奖金为%s万元' % s)


# 方法二：
i = float(input('请输入当月利润(单位：万元)：'))
# 初始化奖金总数
s = 0
# 奖金分6档
arr = [100, 60, 40, 20, 10, 0]
put = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
for i in range(6):
    if i > arr[i]:
        i = i - arr[i]
        s = s + i * put[i]
print('当月发放降金为%s万元' % s)
